STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_audio.c
  if(HAL_DFSDM_FilterRegularStop_DMA(&BSP_AUDIO_hDfsdmLeftFilter) != HAL_OK)
  {
    return AUDIO_ERROR;
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Resumes the audio file stream.
  * @note   The Right channel is start a first with synchro on start Left channel
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Resume(void)
{
  /* Call the Media layer start function for right channel */
  if(HAL_DFSDM_FilterRegularStart_DMA(&BSP_AUDIO_hDfsdmRightFilter,
                                      (int32_t*)hAudioIn.RightRecBuff,
                                      (hAudioIn.RecSize/hAudioIn.ChannelNbr)) != HAL_OK)
  {
    return AUDIO_ERROR;
  }

  /* Call the Media layer start function for left channel */
  if(HAL_DFSDM_FilterRegularStart_DMA(&BSP_AUDIO_hDfsdmLeftFilter,
                                      (int32_t*)hAudioIn.LeftRecBuff,
                                      (hAudioIn.RecSize/hAudioIn.ChannelNbr)) != HAL_OK)
  {
    return AUDIO_ERROR;
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  register user callback functions
  * @param  ErrorCallback: pointer to the error callback function
  * @param  HalfTransferCallback: pointer to the half transfer callback function
  * @param  TransferCompleteCallback: pointer to the transfer complete callback function
  * @retval None
  */
void BSP_AUDIO_IN_RegisterCallbacks(Audio_CallbackTypeDef ErrorCallback,
                                    Audio_CallbackTypeDef HalfTransferCallback,
                                    Audio_CallbackTypeDef TransferCompleteCallback)
{
  hAudioIn.CbError            = ErrorCallback;
  hAudioIn.CbHalfTransfer     = HalfTransferCallback;
  hAudioIn.CbTransferComplete = TransferCompleteCallback;
}

/**
  * @}
  */

/* Private functions --------------------------------------------------------*/
/** @addtogroup STM32L4R9I_EVAL_AUDIO_Private_Functions
  * @{
  */

/*******************************************************************************
                            Static Functions
*******************************************************************************/
/**
  * @brief  Initializes the Audio Codec audio interface (SAI).
  * @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
  * @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       or OUTPUT_DEVICE_BOTH.
  * @note   The default SlotActive configuration is set to CODEC_AUDIOFRAME_SLOT_0123
  *         and user can update this configuration using
  * @retval None
  */
static uint8_t AUDIO_SAIx_Init(uint32_t AudioFreq, uint16_t OutputDevice)
{
  /* Initialize the haudio_out_sai Instance parameter */
  BSP_AUDIO_hSai.Instance = AUDIO_SAIx;

  /* Disable SAI peripheral to allow access to SAI internal registers */
  __HAL_SAI_DISABLE(&BSP_AUDIO_hSai);

  /* Configure SAI_Block_x
  LSBFirst: Disabled
  DataSize: 16 */
  BSP_AUDIO_hSai.Init.AudioMode          = SAI_MODEMASTER_TX;
  BSP_AUDIO_hSai.Init.Synchro            = SAI_ASYNCHRONOUS;
  BSP_AUDIO_hSai.Init.SynchroExt         = SAI_SYNCEXT_DISABLE;
  BSP_AUDIO_hSai.Init.OutputDrive        = SAI_OUTPUTDRIVE_ENABLE;
  BSP_AUDIO_hSai.Init.NoDivider          = SAI_MASTERDIVIDER_ENABLE;
  BSP_AUDIO_hSai.Init.FIFOThreshold      = SAI_FIFOTHRESHOLD_1QF;
  BSP_AUDIO_hSai.Init.AudioFrequency     = SAI_AUDIO_FREQUENCY_MCKDIV;
  BSP_AUDIO_hSai.Init.Mckdiv             = SAIClockDivider(AudioFreq);
  BSP_AUDIO_hSai.Init.MonoStereoMode     = SAI_STEREOMODE;
  BSP_AUDIO_hSai.Init.CompandingMode     = SAI_NOCOMPANDING;
  BSP_AUDIO_hSai.Init.TriState           = SAI_OUTPUT_NOTRELEASED;
  BSP_AUDIO_hSai.Init.Protocol           = SAI_FREE_PROTOCOL;
  BSP_AUDIO_hSai.Init.DataSize           = SAI_DATASIZE_16;
  BSP_AUDIO_hSai.Init.FirstBit           = SAI_FIRSTBIT_MSB;
  BSP_AUDIO_hSai.Init.ClockStrobing      = SAI_CLOCKSTROBING_FALLINGEDGE;
  BSP_AUDIO_hSai.Init.MckOverSampling    = SAI_MCK_OVERSAMPLING_DISABLE;
  BSP_AUDIO_hSai.Init.PdmInit.Activation = DISABLE;

  /* Configure SAI_Block_x Frame
  Frame Length: 64
  Frame active Length: 32
  FS Definition: Start frame + Channel Side identification
  FS Polarity: FS active Low
  FS Offset: FS asserted one bit before the first bit of slot 0 */
  BSP_AUDIO_hSai.FrameInit.FrameLength       = 64;
  BSP_AUDIO_hSai.FrameInit.ActiveFrameLength = 32;
  BSP_AUDIO_hSai.FrameInit.FSDefinition      = SAI_FS_CHANNEL_IDENTIFICATION;
  BSP_AUDIO_hSai.FrameInit.FSPolarity        = SAI_FS_ACTIVE_LOW;
  BSP_AUDIO_hSai.FrameInit.FSOffset          = SAI_FS_BEFOREFIRSTBIT;

  /* Configure SAI Block_x Slot
  Slot First Bit Offset: 0
  Slot Size  : 16
  Slot Number: 4
  Slot Active: 0 and 2 */
  BSP_AUDIO_hSai.SlotInit.FirstBitOffset = 0;
  BSP_AUDIO_hSai.SlotInit.SlotSize       = SAI_SLOTSIZE_DATASIZE;
  BSP_AUDIO_hSai.SlotInit.SlotNumber     = 4;
  if(OutputDevice == OUTPUT_DEVICE_SPEAKER)
  {
    BSP_AUDIO_hSai.SlotInit.SlotActive     = SAI_SLOTACTIVE_1 | SAI_SLOTACTIVE_3;
  }
  else if(OutputDevice == OUTPUT_DEVICE_HEADPHONE)
  {
    BSP_AUDIO_hSai.SlotInit.SlotActive     = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_2;
  }
  else /* OUTPUT_DEVICE_BOTH */
  {
    BSP_AUDIO_hSai.SlotInit.SlotActive     = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1 | SAI_SLOTACTIVE_2 | SAI_SLOTACTIVE_3;
  }

  /* Initializes the SAI peripheral*/
  if (HAL_SAI_Init(&BSP_AUDIO_hSai) != HAL_OK)
  {
    return AUDIO_ERROR;
  }

  /* Enable SAI peripheral to generate MCLK */
  __HAL_SAI_ENABLE(&BSP_AUDIO_hSai);

  return AUDIO_OK;
}

/**
  * @brief  De-initializes the Audio Codec audio interface (SAI).
  * @retval BSP AUDIO status
  */
static uint8_t AUDIO_SAIx_DeInit(void)
{
  /* Disable the SAI audio block */
  __HAL_SAI_DISABLE(&BSP_AUDIO_hSai);

  /* De-initializes the SAI peripheral */
  if (HAL_SAI_DeInit(&BSP_AUDIO_hSai) != HAL_OK)
  {
    return AUDIO_ERROR;
  }

  /* Disable SAIx PLL */
  if(AUDIO_SAIx_PLL_DISABLE() != AUDIO_OK)
  {
    return AUDIO_ERROR;
  }

